# Query your database over an SSH tunnel with Pandas

Blog post related to this notebook is here:<br>
https://medium.com/@amirziai/query-your-database-over-an-ssh-tunnel-with-pandas-603ce49b35a1#.4dzdcrl48

### SSH and database information

In [ ]:
# ssh variables
host = '52.xx.xx.xx'
localhost = '127.0.0.1'
ssh_username = 'ubuntu'
ss_private_key = '/path/to/key.pem'

In [2]:
# database variables
user='user'
password='verysecurepassword'
database='database'

### Install sshtunnel

In [ ]:
!pip install sshtunnel

### Import packages

In [22]:
from sshtunnel import SSHTunnelForwarder
import MySQLdb as db
import pandas as pd

### The query function

In [23]:
def query(q):
    with SSHTunnelForwarder(
        (host, 22),
        ssh_username=ssh_username,
        ssh_private_key=private_key,
        remote_bind_address=(localhost, 3306)
    ) as server:
        conn = db.connect(host=localhost,
                               port=server.local_bind_port,
                               user=user,
                               passwd=password,
                               db=database)

        return pd.read_sql_query(q, conn)

### Query time

In [25]:
df = query('select * from titanic limit 5')

In [21]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S,0